/* ====== الصفحات ====== */
const pages = [
    {
        img: "1.jpeg",
        day: "الذكرى الاولى",
        date: "16 / 2 / 2025",
        text: "اول صوره تبعتهالي و اليوم اخدت عهد ع نفسي اني عمري مااسيب القمر ده ."
    },
    {
        img: "2.jpeg",
        day: "صورة تحفه",
        date: "21 / 3 / 2025",
        text: " صوره بجد فوق الوصف و بحبها جدا و بجد بقعد فيها كتير اوي مش مصدق الجمال ده كله."
    },
    {
        img: "3.jpeg",
        day: "اول مره ننزل date ",
        date: "26 / 3 / 2025",
        text: "اليوم ده اتأكدت إنك مش أي حد كانت احلي مره خرجت فيها اصلا و اول مره امسك ايدك و ابوسها وانتي عملتيلنا احلي ذكري🥹❤️."
    },
    
     {
        img: "4.jpeg",
        day: "اول صوره مع بعض ",
        date: "3 / 7 / 2025",
        text: "صوره بتحكي كتير بجد اول مره نتصور مع بعض ف فتره بجد كانت كلها ضغط و امتحانات و بجد وجودك معايا كان مهون عليا كل ده و كنتي سنداني بجد ❤️❤️❤️."
    },
     {
        img: "5.jpeg",
        day: "لا ع البال ولا ع الخاطر ",
        date: "15 / 9 / 2025",
        text: "صوره فعلا لا كانت لا ع البال ولا ع الخاطر بدوي عملتها و بجد كانت مفاجاه تحفه🥹."
    },
    {
        img: "6.jpeg",
        day: "دكتورتي ",
        date: "15 / 9 / 2025",
        text: "اول صوره لدكتورتي بالبالطو الجديد❤️🥹 ."
    },
    {
        img: "7.jpeg",
        day: "خروجه اوبرا ",
        date: "24 / 9 / 2025",
        text: "من اكتر الخروجات الي اتبسطت فيها بجد و سندتك عليا دي بجد راحه مووت❤️ ."
    },
    {
        img: "8.jpeg",
        day: "خروجه اوبرا",
        date: "24 / 19 / 2025",
        text: "يوم كان تحفه بجد و اكلتيني ب ايدك و كتبتي j ع ايدي ب الروج وانا كنت مبسوط 😂❤️ ."
    },
    {
        img: "9.jpeg",
        day: "فرح نعيم ",
        date: "16 / 10 / 2025",
        text: "من اكتر الافراح الي الواحد بجد اتبسط بيها اوي من وجودك و بجد اليوم ده كنتي زي القمر زي ما هو واضح كده مش هعرف اتكلم عن جمالك اصلا❤️ ."
    },
    {
        img: "10.jpeg",
        day: "فرح نعيم ",
        date: "16 / 10 / 2025",
        text: "برضو نفس اليوم و بجد كنتي احلي من القمر و جمالك ملوش وصف حقيقي و كنت هموت و اقرص خدودك و مردتيش🥹 ."
    },
    {
        img: "11.jpeg",
        day: "فرح نعيم ",
        date: "16 / 10 / 2025",
        text: "يولا ع الدلع و جمال الشعر و الجمال يولاااا😉❤️ ."
    },
    {
        img: "12.jpeg",
        day: "اول حضن ",
        date: "29 / 10 / 2025",
        text: "الصوره دي خرجنا ف المنصوره روحنا نقعد ع النيل و بجد من احلي ايام حياتي و قبلها بيوم بليل اخدت منك اول حضن اخدته ف حياتي كلها لحد النهارده مش عارف اوصفه من حلاوته اول و احلي و احن مره اتحضن فيها ف حياتي كنا عاملين ماتشينج بالغلط😂❤️ ."
    },
    {
        img: "13.jpeg",
        day: "اول حضن ",
        date: "29 / 10 / 2025",
        text: "اوعا يعم صور الدبل و الرومانسييييه 😂❤️ ."
    },
    {
        img: "14.jpeg",
        day: "اجمل يوم ",
        date: "18 / 11 / 2025",
        text: "خروجه بجد كانت فيها كل حاجه بدات مش الطف حاجه بس بعد كانت من احلي الايام الي عيشتها بجد ❤️ ."
    },
    {
        img: "15.jpeg",
        day: "اجمل يوم ",
        date: "18 / 11 / 2025",
        text: "اليوم ده احنا خرجنا و سهرنا مع بعض ع النيل و اصحابك جم رخموا😂و ضحكنا كتير و سمعنا اغاني سوا و ادتيني حضن ع اغنيه نسيت الدنيا و جريت علييه و شيلتك ف حضني و بجد كان يوم خطيرر🥹🥹❤️🫂 ."
    },
    {
        img: "16.jpeg",
        day: "😂 ",
        date: "every day",
        text: "لا عادي ده اكتر استيكر بتستخدميه ف حياتك و ف الشات كملي الي بعده😂 ❤️ ."
    },
    {
        img: "17.jpeg",
        day: "طنطا و الي منها يعم ",
        date: "6 / 12 / 2025",
        text: "اليوم ده كنت هموت و اشوفك و جيتلك طنطا شوفتك و خرجنا و كانت اول مره ندخل سينما سوا و كان الفيلم تحفه و اتبسط اوي بجد و بعدها قعدنا نتمشي ف ملكوت الله مش عارفين حاجه😂بس كنت مبسوط انك معايا  ❤️ ."
    },
    {
        img: "18.jpeg",
        day: "وانا مسافر للاسف ",
        date: "21 / 12 / 2025",
        text: "فضلتي صاحيه معايا و قالقك بجد و عماله تكلميني طول الطريق و منمتيش وهونتي عليا بجد و بعتلي صوره تفرحني اوي بجد و بجد قمر موت ❤️ ."
    },
    {
        img: "19.jpeg",
        day: "😂 ",
        date: "every day",
        text: "لعب عيال لامؤاخذه😂😂 ."
    },
    {
        img: "20.jpeg",
        day: "❤️🫂 ",
        date: "every day",
        text: "شوفي ونبي الايد القمر دي"
    },
    {
        img: "21.png",
        day: "❤️🫂 ",
        date: "21 / 1 / 2026",
        text: "زي النهارده من سنه ي جنجونتي قولتلك انتي الحب الجديد ولعبتي ب اعصابي جامد بس الحمدلله لحقتيني قبل ما اموت منك 😂و بداتيلي من اليوم ده دنيا مكنتش اعرفها و عرفتيني يعني اي حب بجد عايزين بقا صوره السنه الجديددده "
    },
];

let current = 0;

/* ====== عرض الصفحة ====== */
function showPage(i) {
    const img = document.getElementById("photo");

    img.style.transform = "rotateY(-90deg)";
    img.style.opacity = 0.5;

    setTimeout(() => {
        img.src = pages[i].img;
        document.getElementById("day").innerText = pages[i].day;
        document.getElementById("date").innerText = pages[i].date;
        document.getElementById("feeling").innerText = pages[i].text;

        img.style.transform = "rotateY(0deg)";
        img.style.opacity = 1;
    }, 400);
}


function nextPage() {
    current = (current + 1) % pages.length;
    showPage(current);
}

function prevPage() {
    current = (current - 1 + pages.length) % pages.length;
    showPage(current);
}

showPage(0);

/* ====== العداد ====== */
const startDate = new Date("2025-01-21T00:00:00");

function updateCounter() {
    const now = new Date();
    const diff = now - startDate;

    const days = Math.floor(diff / (1000 * 60 * 60 * 24));
    const hours = Math.floor((diff / (1000 * 60 * 60)) % 24);
    const minutes = Math.floor((diff / (1000 * 60)) % 60);

    document.getElementById("counter").innerText =
        `عدينا مع بعض ${days} يوم و ${hours} ساعة و ${minutes} دقيقة ❤️`;
}

setInterval(updateCounter, 1000);
updateCounter();
const music = document.getElementById("music");
const musicBtn = document.querySelector(".music-btn");

function toggleMusic() {
    if (music.paused) {
        music.play();
        musicBtn.innerText = "⏸️";
    } else {
        music.pause();
        musicBtn.innerText = "▶️";
    }
}
document.body.addEventListener("click", () => {
    music.play();
}, { once: true });




